export const timetable = {
  state: () => ({
    timetable: [
      // Числитель
      [
        // Пн
        [
          {
            id: 0,
            time: ["8.30", "10.00"],
            type: "лк",
            name: "Архитектура вычислительных систем",
            cabinet: "Б 204",
          },
          {
            id: 1,
            time: ["10.15", "11.45"],
            type: "лк",
            name: "Операционные системы",
            cabinet: "Б 204",
          },
        ],
        // Вт
        [
          {
            id: 0,
            time: ["8.30", "10.00"],
            type: "лб",
            name: "Архитектура вычислительных систем",
            cabinet: "Б 213",
          },
          {
            id: 1,
            time: ["10.15", "11.45"],
            type: "лб",
            name: "Архитектура вычислительных систем",
            cabinet: "Б 213",
          },
          {
            id: 2,
            time: ["12.00", "13.30"],
            type: "лк",
            name: "Философия",
            cabinet: "А 2",
          },
        ],
        // Ср
        [
          {
            id: 0,
            time: ["10.15", "11.45"],
            type: "",
            name: "Элективные курсы по физической культуре и спорту",
            cabinet: "",
          },
          {
            id: 1,
            time: ["12.00", "13.30"],
            type: "лк",
            name: "Дискретная математика",
            cabinet: "401",
          },
          {
            id: 2,
            time: ["14.00", "15.30"],
            type: "у",
            name: "Дискретная математика",
            cabinet: "401",
          },
        ],
        // Чт
        [
          {
            id: 0,
            time: ["8.30", "10.00"],
            type: "у",
            name: "Высшая математика",
            cabinet: "406",
          },
          {
            id: 1,
            time: ["10.15", "11.45"],
            type: "у",
            name: "Теоретические основы электротехники",
            cabinet: "Б 214",
          },
          {
            id: 2,
            time: ["12.00", "13.30"],
            type: "лб",
            name: "Операционные системы",
            cabinet: "Б 209",
          },
          {
            id: 3,
            time: ["14.00", "15.30"],
            type: "лб",
            name: "Операционные системы",
            cabinet: "Б 209",
          },
        ],
        // Пт
        [
          {
            id: 0,
            time: ["8.30", "10.00"],
            type: "лк",
            name: "Высшая математика",
            cabinet: "406",
          },
          {
            id: 1,
            time: ["10.15", "11.45"],
            type: "лк",
            name: "Теоретические основы электротехники",
            cabinet: "Б 204",
          },
          {
            id: 2,
            time: ["12.00", "13.30"],
            type: "",
            name: "Элективные курсы по физической культуре и спорту",
            cabinet: "",
          },
        ],
      ],
      // Знаменатель
      [
        // Пн
        [
          {
            id: 0,
            time: ["8.30", "10.00"],
            type: "лк",
            name: "Архитектура вычислительных систем",
            cabinet: "Б 204",
          },
          {
            id: 1,
            time: ["10.15", "11.45"],
            type: "лк",
            name: "Операционные системы",
            cabinet: "Б 204",
          },
          {
            id: 2,
            time: ["12.00", "13.30"],
            type: "у",
            name: "Высшая математика",
            cabinet: "522",
          },
        ],
        // Вт
        [
          {
            id: 0,
            time: ["8.30", "10.00"],
            type: "кр",
            name: "Архитектура вычислительных систем",
            cabinet: "Б 213",
          },
          {
            id: 1,
            time: ["10.15", "11.45"],
            type: "кр",
            name: "Архитектура вычислительных систем",
            cabinet: "Б 213",
          },
          {
            id: 2,
            time: ["12.00", "13.30"],
            type: "у",
            name: "Философия",
            cabinet: "225",
          },
        ],
        // Ср
        [
          {
            id: 0,
            time: ["10.15", "11.45"],
            type: "",
            name: "Элективные курсы по физической культуре и спорту",
            cabinet: "",
          },
          {
            id: 1,
            time: ["12.00", "13.30"],
            type: "лк",
            name: "Дискретная математика",
            cabinet: "401",
          },
          {
            id: 2,
            time: ["14.00", "15.30"],
            type: "у",
            name: "Дискретная математика",
            cabinet: "401",
          },
        ],
        // Чт
        [
          {
            id: 0,
            time: ["12.00", "13.30"],
            type: "лб",
            name: "Теоретические основы электротехники",
            cabinet: "А 310 А 315",
          },
          {
            id: 1,
            time: ["14.00", "15.30"],
            type: "лб",
            name: "Теоретические основы электротехники",
            cabinet: "А 310 А 315",
          },
        ],
        // Пт
        [
          {
            id: 0,
            time: ["8.30", "10.00"],
            type: "лк",
            name: "Высшая математика",
            cabinet: "406",
          },
          {
            id: 1,
            time: ["10.15", "11.45"],
            type: "лк",
            name: "Теоретические основы электротехники",
            cabinet: "Б 204",
          },
          {
            id: 2,
            time: ["12.00", "13.30"],
            type: "",
            name: "Элективные курсы по физической культуре и спорту",
            cabinet: "",
          },
        ],
      ],
    ],
  }),
  getters: {
    getCurrentTimetable: (state) => {
      const date = new Date();
      return state.timetable[
        Math.floor(
          (Math.round(date.getMonth() * 30.4167 + date.getDate()) - 3) / 7
        ) % 2
      ][date.getDay() - 1];
    },
    getTimetable: (state) => {
      const date = new Date();
      return state.timetable[
        Math.floor(
          (Math.round(date.getMonth() * 30.4167 + date.getDate()) - 3) / 7
        ) % 2
      ];
    },
  },
};
